#+TITLE: Practical CTF Hacking
#+AUTHOR: David Brumley and the 18739L Spring 2015 Class


*** Providing command-generated input
Suppose you want to provide a long input to a program. We can use our
one-liners from above to generate the input, and use the modern shell
feature of using ~(<cmd>)~. 

For example, the following command will run ~python~ in a subshell
with a small one-liner  that prints 40 ~A~ characters in a row.

#+NAME: print40
#+begin_src sh
echo $(python -c 'print "A"*40')
#+end_src

The results are:

#+RESULTS: print40
: AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA

Of course you can run any unix command.  The following echos ~/bin/ls~
to ~objdump~, which then pipes to ~head~ to print the first 5 results:

#+name: objdumpls
#+begin_src sh
objdump -D $(echo /bin/ls) | head -5
#+end_src

#+results: objdumpls
|             |      |         |               |
| /bin/ls:    | file | format  | mach-o-x86-64 |
|             |      |         |               |
|             |      |         |               |
| Disassembly | of   | section | .text:        |

Another (and older) method is to use backticks:

#+name: backtick40
#+begin_src sh
echo `python -c 'print "B"*40'`
#+end_src

The results are:
#+results: backtick40
: BBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBBB

Using the ~(<cmd>)~ syntax is newer and the recommended method for
invoking a command. The backticks have been deprecated in favor of ~$()~
for command substitution because $() can easily nest within itself as
in ~$(echo foo$(echo bar))~. There are also minor differences such as
how backslashes are parsed in the backtick version[fn:1].

[fn:1] See [[http://stackoverflow.com/questions/4708549/shell-programming-whats-the-difference-between-command-and-command][Shell Programming: What's the difference between $(command) and `command`]]


